app/views/sections/_form.html.erb

    <th>Page</th>
    <td><%= f.object.page.name %></td>
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1