app/controllers/admin_users_controller.rb

  def create
    @admin_user = AdminUser.new(admin_user_params)
    if @admin_user.save
---
INSERT INTO `admin_users` (`first_name`, `last_name`, `email`, `username`, `created_at`, `updated_at`, `password_digest`) VALUES ('John', 'Doe', 'nobody@nowhere.com', 'johndoe1', '2016-12-19 15:30:22', '2016-12-19 15:30:22', '$2a$10$PAQo0oeXXKEUOepX5MPGbujNoGEqGYb89NvLcw5dEDhJdea6zbc.K')