app/controllers/pages_controller.rb

INSERT INTO `pages` (`subject_id`, `name`, `permalink`, `position`, `visible`, `created_at`, `updated_at`) VALUES (4, 'test', 'third', 1, 1, '2017-01-05 15:57:26', '2017-01-05 15:57:26')
---
  def create
    @page = Page.new(page_params)
    @page.subject = @subject
    if @page.save

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
---
  def edit
    @page = Page.find(params[:id])

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
UPDATE `pages` SET `visible` = 1, `updated_at` = '2016-12-21 15:55:37' WHERE `pages`.`id` = 1
---
  def update
    # Find a new object using form parameters
    @page = Page.find(params[:id])
    # update the object
    if @page.update_attributes(page_params)

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 11 LIMIT 1
---
  def find_subject
    @subject = Subject.find(params[:subject_id])

SELECT COUNT(*) FROM `pages` WHERE `pages`.`subject_id` = 4
---
  def set_page_count
    @page_count = @subject.pages.count