app/controllers/sections_controller.rb

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `sections` WHERE `sections`.`page_id` = 4
INSERT INTO `sections` (`page_id`, `name`, `position`, `visible`, `content_type`, `content`, `created_at`, `updated_at`) VALUES (1, 'Another one', 2, 1, 'HTML', '<strong>Hello</strong> everyone', '2016-12-21 15:55:06', '2016-12-21 15:55:06')
---
  def create
    @section = Section.new(section_params)
    @section.page = @page
    if @section.save

SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
---
  def edit
    @section = Section.find(params[:id])

SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
UPDATE `sections` SET `updated_at` = '2017-01-05 16:44:36.702643', `position` = (`sections`.`position` + 1) WHERE `sections`.`page_id` = 5 AND (`sections`.`position` >= 1) AND (`sections`.`position` < 2 AND `sections`.id != 11)
---
  def update
    # Find a new object using form parameters
    @section = Section.find(params[:id])
    # update the object
    if @section.update_attributes(section_params)

SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 8 LIMIT 1 FOR UPDATE
DELETE FROM `sections` WHERE `sections`.`id` = 6
---
  def destroy
    @section = Section.find(params[:id])
    @section.destroy

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 5 LIMIT 1
---
  def find_page
    @page = Page.find(params[:page_id])

SELECT COUNT(*) FROM `sections` WHERE `sections`.`page_id` = 5
---
  def set_section_count
    @section_count = @page.sections.count