app/controllers/subjects_controller.rb

  def edit
    @subject = Subject.find(params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 11 LIMIT 1

  def update
    # Find a new object using form parameters
    @subject = Subject.find(params[:id])
    # update the object
    if @subject.update_attributes(subject_params)
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
UPDATE `subjects` SET `updated_at` = '2017-01-05 15:15:49.301466', `position` = (`subjects`.`position` + 1) WHERE (1 = 1) AND (`subjects`.`position` >= 1) AND (`subjects`.`position` < 3 AND `subjects`.id != 13)

  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 12 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 12

  def set_subject_count
    @subject_count = Subject.count
---
SELECT COUNT(*) FROM `subjects`