app/views/layouts/_navigation.html.erb

SELECT `pages`.* FROM `pages` WHERE `pages`.`subject_id` = 11 AND `pages`.`visible` = 1 ORDER BY position ASC
---
      <ul>
      <% subject.pages.visible.sorted.each do |page| %>